= Anypoint Platform CLI 3.x List of Commands

ifndef::env-site,env-github[]
include::_attributes.adoc[]
endif::[]
:keywords: administration, api, organization, users, gateway, theme, cli
:page-aliases: cloudhub-cli.adoc

image:logo-cloud-active.png[xref="deployment-strategies.adoc#cloudhub-deployments", title="CloudHub"]
image:logo-hybrid-active.png[xref="deployment-strategies.adoc#hybrid-deployments", title="Hybrid"]
image:logo-server-active.png[xref="deployment-strategies.adoc#anypoint-platform-pce-deployments", title="Anypoint Platform PCE"]
image:logo-rtf-active.png[xref="deployment-strategies.adoc#anypoint-runtime-fabric-deployments", title="Runtime Fabric"]

Anypoint Platform CLI provides commands for different use case scenarios:

* <<Commands For Administering Your Anypoint Platform Account>>
* <<Commands for API Manager>>
* <<Commands for Administering Your Design Center Applications>>
* <<Commands for Managing Anypoint DataGraph>>
* <<Commands for Managing Exchange Assets>>
* <<Commands for Administering Your CloudHub Application>>
* <<Commands for Managing Your Locally Deployed Applications Managed by Runtime Manager>>
* <<Command for Listing Your Runtime Fabric Instances>>
* <<Commands for Managing Your Local Servers>>
* <<Commands for Administering Your Local Server Groups>>
* <<Commands for Administering Your Local Cluster Servers>>
* <<Commands for Managing Alerts for Your Locally Deployed Applications Managed by Runtime Manager>>
* <<Commands for Managing Your CloudHub Dedicated Load Balancer>>
* <<Commands for Managing Your CloudHub Anypoint VPC>>
* <<Commands for Specifying Environments and Business Groups>>


[TIP]
--
The Anypoint Platform CLI provides three default options:

* The `--help` option displays usage information of the command.
* The `-o` or `--output` option lets you specify the command's output to the defined format. +
Supported values are `table`, `text`, and `json`. Defaults to `text` for non-interactive mode and `table` for interactive sessions.
* The `-f` or `--fields` option allows you to define which fields to output. +
You can pass the `--fields` option after a command to get a list of all possible fields to output.
--

== Commands For Administering Your Anypoint Platform Account

[%header,cols="35a,65a"]
|===
|Command |Description
|<<account user describe>>| Show account details
|<<account business-group list>>| Lists business groups
|<<account business-group describe>>| Show details of a business group
|<<account environment list>>| Lists environments
|<<account environment create>>| Create new environment
|<<account environment delete>>| Delete an environment
|<<account environment describe>> | Shows details of an environment
|===

== Commands for API Manager

[%header,cols="35a,65a"]
|===
|Command |Description
|<<api-mgr alert add>> | Creates an API instance alert
|<<api-mgr alert list>> | Lists alerts for an API instance
|<<api-mgr api change-specification>> | Changes the asset version for an API instance by choosing a new version from Exchange
|<<api-mgr api classify>> |Classifies an API instance in a given environment
|<<api-mgr api delete>> | Deletes an API
|<<api-mgr api deploy>> | Deploys an API to CloudHub, hybrid server, or Runtime Fabric
|<<api-mgr api deprecate>> | Deprecates an API instance
|<<api-mgr api describe>> | Shows details of an API
|<<api-mgr api download-proxy>> | Downloads the API proxy ZIP file to a local directory
|<<api-mgr api edit>> | Edits an API instance
|<<api-mgr api list>> | Lists all APIs in API Manager 2.x
|<<api-mgr api manage>> | Manages a new API, API version, or new API instance with an asset from Exchange
|<<api-mgr api promote>> | Promotes an API instance from source environment
|<<api-mgr api redeploy>> | Redeploys an API to CloudHub, Hybrid server, or Runtime Fabric
|<<api-mgr api undeprecate>> | Undeprecates an API instance
|<<api-mgr contract delete>> | Deletes a given API contract
|<<api-mgr contract list>> | Lists all contracts to a given API instance.
|<<api-mgr policy apply>> | Applies a policy to a given API instance
|<<api-mgr policy describe>> | Shows the description and available configuration properties of a given policy template
|<<api-mgr policy disable>> | Disables policy from a given API instance
|<<api-mgr policy edit>> | Edits the policy configuration of a given API instance
|<<api-mgr policy enable>> | Enables a policy on a given API instance
|<<api-mgr policy list>> | Lists policies
|<<api-mgr policy remove>> | Removes a policy from a given API instance
|<<api-mgr tier add>> | Creates an SLA tier
|<<api-mgr tier copy>> | Copies an SLA tier from source to a target API Instance
|<<api-mgr tier delete>> | Deletes an SLA tier from an API instance
|<<api-mgr tier list>> | Lists the SLA tiers of an API instance
|===

== Commands for Managing Anypoint DataGraph

[%header,cols="35a,65a"]
|===
|Command |Description
| <<datagraph load-balancer-config add>> | Adds a dedicated load balancer configuration to Anypoint DataGraph
| <<datagraph load-balancer-config describe>> | Displays a dedicated load balancer configuration for Anypoint DataGraph
| <<datagraph load-balancer-config remove>> | Removes a dedicated load balancer configuration from Anypoint DataGraph
|===

== Commands for Administering Your Design Center Applications

[%header,cols="35a,65a"]
|===
|Command |Description
| <<designcenter project create>> | Creates a new Design Center project
| <<designcenter project delete>> | Deletes a Design Center project
| <<designcenter project download>> | Downloads the content of a Design Center project
| <<designcenter project publish>> | Publishes a Design Center project to Exchange
| <<designcenter project upload>> | Uploads the content of a project to Design Center
| <<designcenter project list>> | List all Design Center projects
|===

== Commands for Managing Exchange Assets

[%header,cols="35a,65a"]
|===
|Command |Description
|<<exchange asset upload>> | Uploads an Exchange asset
|<<exchange asset uploadv2>> | Uploads an Exchange asset using Exchange Experience API v2
|<<exchange asset mutableDataUpload>> | Modifies mutable data of an existing Exchange asset
|<<exchange asset modify>> | Modifies an Exchange asset
|<<exchange asset download>> | Downloads an Exchange asset
|<<exchange asset list>> | Lists all assets
|<<exchange asset page download>> | Downloads an asset's description page from Exchange
|<<exchange asset page modify>> | Changes an asset's description page from Exchange
|<<exchange asset page upload>> | Uploads an asset's description page from Exchange
|<<exchange asset page update>> | Updates an asset's description page from Exchange
|<<exchange asset page delete>> | Deletes an asset's description page from Exchange
|<<exchange asset page list>> | List all pages for a given asset
|<<exchange asset copy>> | Copies an Exchange asset
|<<exchange asset delete>> | Deletes an asset from Exchange
|<<exchange asset deprecate>> | Deprecates an asset
|<<exchange asset undeprecate>> | Undeprecate an asset
|<<exchange asset describe>> | Show a given asset's information
|<<exchange asset resource upload>> | Uploads a resource to an asset portal
|<<exchange asset resource list>> | Lists published resources in the asset portal
|<<exchange asset resource download>> | Downloads resource from the asset portal
|<<exchange asset resource delete>> | Deletes resource from the asset portal
|===

== Commands for Administering Your CloudHub Application

[%header,cols="35a,65a"]
|===
|Command |Description
|<<runtime-mgr cloudhub-alert list>>| Lists all alerts in the environment
|<<runtime-mgr cloudhub-alert-history describe>>| Describes the history of the alarm
|<<runtime-mgr cloudhub-application list>>| Lists all applications in the environment
|<<runtime-mgr cloudhub-application describe>>| Show application details
|<<runtime-mgr cloudhub-application describe-json>>| Show raw application JSON response
|<<runtime-mgr cloudhub-application stop>>| Stop a running application
|<<runtime-mgr cloudhub-application start>>| Start an application
|<<runtime-mgr cloudhub-application restart>>| Restart a running application
|<<runtime-mgr cloudhub-application delete>>| Delete an application
|<<runtime-mgr cloudhub-application deploy>>| Deploy a new application
|<<runtime-mgr cloudhub-application modify>>| Modify an existing application, optionally updating the ZIP file
// |<<runtime-mgr application revert-runtime>>| Reverts application to its previous runtime
|<<runtime-mgr cloudhub-application download-logs>>| Download application logs to specified directory
|<<runtime-mgr cloudhub-application tail-logs>>| Tail application logs
|<<runtime-mgr cloudhub-application copy>>| Copies a CloudHub application
// |<<runtime-mgr cloudhub-application upgrade-runtime>>| Upgrades application runtime to the latest patch version or if a version if specified, to that version.
// |<<runtime-mgr cloudhub-application downgrade-runtime>>| Downgrades application runtime to the previous runtime version or if a version is specified, to that version.
|===

[[standalone-management]]
== Commands for Managing Your Locally Deployed Applications Managed by Runtime Manager

[CAUTION]
In order for the Anypoint Platform CLI to recognize your target servers, each server needs to be manually registered with the platform.

[%header,cols="35a,65a"]
|===
|Command |Description
|<<runtime-mgr standalone-application artifact>> | Downloads a standalone application artifact binary
|<<runtime-mgr standalone-application deploy>> | Deploys or redeploys an application to an on-premises server, server group, or cluster
|<<runtime-mgr standalone-application describe-json>> | Shows a raw standalone application JSON response
|<<runtime-mgr standalone-application modify>> | Changes a standalone application artifact
|<<runtime-mgr standalone-application start>> | Starts a standalone application
|<<runtime-mgr standalone-application delete>> | Deletes a standalone application
|<<runtime-mgr standalone-application describe>> | Shows detailed information for a standalone application
|<<runtime-mgr standalone-application list>> | Lists all standalone applications in the environment
|<<runtime-mgr standalone-application restart>> | Restarts a standalone application
|<<runtime-mgr standalone-application stop>> | Stops a standalone application
|<<runtime-mgr standalone-application copy>> | Copies a standalone application
|===

== Command for Listing Your Runtime Fabric Instances

[%header,cols="35a,65a"]
|===
|Command |Description
|<<runtime-mgr rtf list>>  | Lists available Runtime Fabric instances
|===


== Commands for Managing Your Local Servers

[%header,cols="35a,65a"]
|===
|Command |Description
|<<runtime-mgr server describe>> | Describes server
|<<runtime-mgr server modify>> | Modifies server
|<<runtime-mgr server token>> | Gets server registration token. This token needs to be used to register a new server
|<<runtime-mgr server delete>> | Deletes server
|<<runtime-mgr server list>> | Changes an standalone application artifact
// |<<runtime-mgr server register>> | Registers a new server. Returns a signed certificate which is downloaded to the `directory` path
|===

== Commands for Administering Your Local Server Groups

[%header,cols="35a,65a"]
|===
|Command |Description
|<<runtime-mgr serverGroup create>> | Creates server group from servers
|<<runtime-mgr serverGroup describe>> | Describes server group
|<<runtime-mgr serverGroup modify>> | Modifies server group
|<<runtime-mgr serverGroup add server>> | Adds server to a server group
|<<runtime-mgr serverGroup delete>> | Deletes server group
|<<runtime-mgr serverGroup list>> | Lists all server groups in the environment
|<<runtime-mgr serverGroup remove server>> | Removes server from a server group
|===

== Commands for Administering Your Local Cluster Servers

[%header,cols="35a,65a"]
|===
|Command |Description
|<<runtime-mgr cluster add server>> | Adds server to cluster
|<<runtime-mgr cluster delete>> | Deletes cluster
|<<runtime-mgr cluster list>> | Lists all clusters in the environment
|<<runtime-mgr cluster remove server>> | Removes server from a cluster
|<<runtime-mgr cluster create>> | Creates new cluster
|<<runtime-mgr cluster describe>> | Describes server cluster
|<<runtime-mgr cluster modify>> | Modifies cluster
|===


== Commands for Managing Alerts for Your Locally Deployed Applications Managed by Runtime Manager

[%header,cols="35a,65a"]
|===
|Command |Description
|<<runtime-mgr standalone-alert describe>> | Describes an alert
|<<runtime-mgr standalone-alert create>> | Creates new alert for standalone runtime
|<<runtime-mgr standalone-alert modify>> | Modifies alert for standalone runtime
|<<runtime-mgr standalone-alert list>> | Lists all alerts for standalone runtimes in the environment
|===

== Commands for Managing Your CloudHub Dedicated Load Balancer

[%header,cols="35a,65a"]
|===
|Command |Description
|<<cloudhub load-balancer list>>| Lists all load balancers in an organization
|<<cloudhub load-balancer describe>>| Show load balancer details
|<<cloudhub load-balancer describe-json>>| Show load balancer details in raw JSON response
|<<cloudhub load-balancer create>>| Create a load balancer
|<<cloudhub load-balancer start>>| Starts a load balancer
|<<cloudhub load-balancer stop>>| Stops a load balancer
|<<cloudhub load-balancer delete>>| Delete a load balancer
|<<cloudhub load-balancer ssl-endpoint add>>| Add an additional certificate to an existing load balancer
|<<cloudhub load-balancer ssl-endpoint remove>>| Remove a certificate from a load balancer
|<<cloudhub load-balancer ssl-endpoint set-default>>| Set the default certificate that the load balancer will serve
|<<cloudhub load-balancer ssl-endpoint describe>>| Show the load balancer configuration for a particular certificate
|<<cloudhub load-balancer whitelist add>>| Add an IP or range of IPs to the load balancer allowlist
|<<cloudhub load-balancer whitelist remove>>| Remove an IP or range of IPs from the load balancer allowlist
|<<cloudhub load-balancer mappings describe>>| Lists the proxy mapping rules for a load balancer. If no `certificateName` is given, the mappings for the default SSL endpoint are shown
|<<cloudhub load-balancer mappings add>>| Add a proxy mapping rule at the specified index. If no `certificateName` is given, the mappings for the default SSL endpoint are shown
|<<cloudhub load-balancer mappings remove>>| Remove a proxy mapping rule. If no `certificateName` is given, the mappings for the default SSL endpoint are shown.
|<<cloudhub load-balancer dynamic-ips enable>>| Enables dynamic IPs
|<<cloudhub load-balancer dynamic-ips disable>>| Disables dynamic IPs
|<<cloudhub region list>>| Lists all supported regions
|<<cloudhub runtime list>>| Lists all available runtimes
|===

== Commands for Managing Your CloudHub Anypoint VPC

[%header,cols="35a,65a"]
|===
|Command |Description
|<<cloudhub vpc list>>| Lists all Anypoint VPCs
|<<cloudhub vpc describe>>| Show Anypoint VPC details
|<<cloudhub vpc describe-json>>| Show raw Anypoint VPC JSON response
|<<cloudhub vpc create>>| Create a new Anypoint VPC
|<<cloudhub vpc delete>>| Delete an existing Anypoint VPC
|<<cloudhub vpc environments add>>| Modifies the Anypoint VPC association to Runtime Manager environments.
|<<cloudhub vpc environments remove>>| Modifies the Anypoint VPC association to Runtime Manager environments.
|<<cloudhub vpc business-groups add>>| Share an Anypoint VPC with a list of Business Groups.
|<<cloudhub vpc business-groups remove>>| Share an Anypoint VPC with a list of Business Groups.
|<<cloudhub vpc dns-servers set>>| Sets the domain names that are resolved using your internal DNS servers. If used with no option, internal DNS will be disabled
|<<cloudhub vpc dns-servers unset>>| Clears the list domain names that are resolved using your internal DNS servers
|<<cloudhub vpc firewall-rules describe>>| Show firewall rule for Mule applications in this Anypoint VPC
|<<cloudhub vpc firewall-rules add>>| Add a firewall rule for Mule applications in this Anypoint VPC
|<<cloudhub vpc firewall-rules remove>>| Remove a firewall rule for Mule applications in this Anypoint VPC
|===

== Commands for Specifying Environments and Business Groups

[%header,cols="35a,65a"]
|===
|Command |Description
|<<use environment>>| Make specified environment active
|<<use business-group>>| Make specified business-group active
|===

An Anypoint Platform CLI call has the following form:

[source,console]
----
$ anypoint-cli [params] [command]
----

If you choose not to pass a command, Anypoint Platform CLI runs in interactive mode.
If you choose to pass a specific command and there is an error, the application exits and return you a description of the issue.

=== account user describe

----
> account user describe  [options]
----

This command simply returns the information for your account. This includes your username, your full name, your email address, and the creation date of your account. +
This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== account business-group list

----
> account business-group list [options]
----

This command displays all xref:access-management::organization.adoc#business-groups[business groups]. It returns the name of the business group, the type ('Master' or 'Business unit'), and the ID.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]


=== account business-group describe

----
> account business-group describe  [options] <name>
----

This command displays information on the business group you pass in `<name>`. +
If `<name>` is not specified, the command describes the business group on the current session.

[NOTE]
--
If your business group or organization name contains spaces, you need to enclose its name between `"` characters.

----
> account business-group describe "QA Organization"
----
--

It returns data such as the owner, the type, subscription information, the entitlements of the group and in which environment is running.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== account environment list

----
> account environment list [options]
----
This command lists all your environments in Anypoint Platform. It returns your environment name, Id and whether it's sandboxed or not. +
This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== account environment create

----
> account environment create [options] <name>
----
This command creates a new environment using the name you set in `<name>`. +
Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes the `--type` option. Use the `--type` option to specify the environment type. +
Supported values for environment types are:

* `design`
* `production`
* `sandbox`

If no type is specified, the command creates a production environment.

=== account environment delete

----
> account environment delete  [options] <name>
----
This command deletes the environment specified in `<name>` +

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== account environment describe

----
> account environment describe [options] <name>
----

This command returns information about the environment specified in `<name>` +
If no `<name>` is provided, this command returns information about the current session's environment.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr alert add

----
> api-mgr alert add [options] <apiInstanceId> <name>
----

This command creates an API instance alert with the name passed in `name` for the API Instance Id passed in `<apiInstanceId>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `enabled`
| Sets whether the alert should be enabled or not. +
Possible values are `true` or `false`.

| `severity <val>`
| Alert severity. +
Supported values: `Info`, `Warning`, `Critical`.

| `type <val>`
| Alert type/condition. +
Supported values: `request-count`, `response-code`, `policy-violation`, `response-time`

| `operator <val>`
| Condition operator explaining values relation to threshold. +
Supported values: gt, lt, eq

| `threshold <num>`
| Condition occurrences threshold number.

| `periods <num>`
| Number of consecutive periods condition should occur for.

| `duration <num>`
| Condition occurrence period duration.

| `durationUnit <val>`
| Condition occurrence period duration unit. +
Supported values: days, hours, minutes.

| `recipient [username]`
| Username to send alert notification to. +
You can pass this option multiple times to specify multiple usernames.

| `email [emailAddress]`
| Email to send alert notification to. +
You can pass this option multiple times to specify multiple emails.

| `responseTime [num]`
| Response time to trigger `response-time` alert type.

| `responseCode [code]`
| Response codes to trigger `response-code` alert type. +
You can pass this option multiple times to specify multiple codes.

| `policyId [num]`
| ID of a policy applied to API instance to trigger `response-code` alert type.
|===

=== api-mgr alert list

----
> api-mgr alert list [options] <apiInstanceId>
----

Lists alerts for the API instance passed in `<apiInstanceId>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a,a"]
|===
|Value |Description | Example
| `--offset` | Offsets the amount of APIs passed | `api-mgr alert list --offset 3`
| `--sort` | Sorts the results in the field name passed | `api-mgr alert list --sort "Latest Version"`
|===


=== api-mgr api change-specification

----
> api-mgr api change-specification [options] <apiInstanceId> <assetVersion>
----

Changes the asset version for the API instance passed in `<apiInstanceId`,  by choosing a new version from Exchange passed in `<assetVersion>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr api classify

----
> api-mgr api classify [options] <destEnvName> <apiInstanceId>
----

Classifies the API instance passed in `<apiInstanceId>` in the  environment passed in `<destEnvName>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr api delete

----
> api-mgr api delete [options] <apiInstanceId>
----

This command deletes the API instance passed in `<apiInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr api deploy

----
> api-mgr api deploy [options] <apiInstanceId>
----

This command deploys the API instance passed in <apiInstanceId> to the deployment target specified using the options described below.

[NOTE]
This command is only supported for endpoints with proxy.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a,a"]
|===
|Value |Description | Example
| `target <id>`
| Hybrid or RTF deployment target ID. +
| `api-mgr api deploy --target 1598794 643404`

| `applicationName <name>`
| Application name
| `api-mgr api deploy --applicationName myMuleApp 643404`

| `environmentName <name>`
| Target environment name. Should only be used when deploying APIs from unclassified environments.
| `api-mgr api deploy --environmentName TestEnv 643404`

| `gatewayVersion <version>`
| The CloudHub Gateway version
| `api-mgr api deploy --gatewayVersion: 9.9.9.9  643404`

| `overwrite`
| Update application if it exists. +
It takes `true` or `false` values.
| `api-mgr api deploy --overwrite: true  643404`

|===

=== api-mgr api deprecate

----
> api-mgr api deprecate [options] <apiInstanceId>
----

Deprecates the API instance passed in `<apiInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr api describe

----
> api-mgr api describe [options] <apiInstanceId>
----

Shows details of the API Instance passed in `<apiInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr api download-proxy

----
> api-mgr api download-proxy [options] <apiInstanceId> <targetPath>
----

This command downloads the API proxy ZIP file of the API Instance passed in `<apiInstanceId>` to a local directory specified in `<targetPath>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes a `gatewayVersion` option to specify the gateway version you want to download.
For example: `api-mgr api download-proxy --gatewayVersion: 4.0.1  643404 /tmp/`

=== api-mgr api edit

----
> api-mgr api edit [options] <apiInstanceId>
----

Edits the API instance passed in `<apiInstanceId>`. +
Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `-p, --withProxy`
| Indicates whether the endpoint should use a proxy. +
This option takes `true` or `false` values.

| `-r, --referencesUserDomain`
| Indicates whether a proxy should reference a user domain. +
This option takes `true` or `false` values.

| `-m, --muleVersion4OrAbove`
| Indicates whether you are managing this API in Mule 4 or above. +
This option takes `true` or `false` values.

| `--deploymentType <value>`
| Deployment type. +
Supported values are `cloudhub`, `hybrid`, or `rtf`.

| `--endpointUri <value>`
| Consumer endpoint URI.

| `--uri <value>`
| Implementation URI.

| `--scheme <value>`
| Proxy scheme. +
Supported values are `http`, or `https`.

| `--port <value>`
| Proxy port.

| `--path <value>`
| Proxy path.

| `--responseTimeout <value>`
| Your maximum response timeout.

| `--apiInstanceLabel <value>`
| (Optional) API instance label.

| `--serviceName <value>`
| WSDL service name.

| `--serviceNamespace <value>`
| WSDL service namespace.

| `--servicePort <value>`
| WSDL service port.

|===

=== api-mgr api list

----
> api-mgr api list [options]
----

Lists all APIs in API Manager 2.x.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `--assetId <value>`       | Asset ID by which filter results.
| `--apiVersion <value>`    | API version by which filter results.
| `--instanceLabel <value>` | API instance label by which  filter results.
| `--limit <num>`           | Number of results to retrieve.
| `--offset` | Offsets the amount of APIs passed
| `--sort` | Sorts the results in the field name passed
|===

=== api-mgr api manage

----
> api-mgr api manage [options] <assetId> <assetVersion>
----

Manages a new API, API version, or new API instance with the Exchange asset passed in `<assetId>`, and the version passed in `<assetVersion>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `--type <value>`
| Endpoint type. +
Accepted values are `http`, `raml`, or `wsdl`.

| `-p, --withProxy`
| Indicates whether the endpoint should use a proxy. +
This option takes `true` or `false` values.

| `-r, --referencesUserDomain`
| Indicates whether a proxy should reference a user domain. +
This option takes `true` or `false` values.

| `-m, --muleVersion4OrAbove`
| Indicates whether you are managing this API in Mule 4 or above. +
This option takes `true` or `false` values.

| `--deploymentType <value>`
| Deployment type. +
Supported values are `cloudhub`, `hybrid`, or `rtf`.

| `--endpointUri <value>`
| Consumer endpoint URI.

| `--uri <value>`
| Implementation URI.

| `--scheme <value>`
| Proxy scheme. +
Supported values are `http`, or `https`.

| `--port <value>`
| Proxy port.

| `--path <value>`
| Proxy path.

| `--responseTimeout <value>`
| Response timeout.

| `--apiInstanceLabel <value>`
| (Optional) API instance label.

| `--serviceName <value>`
| WSDL service name.

| `--serviceNamespace <value>`
| WSDL service namespace.

| `--servicePort <value>`
| WSDL service port.
|===


=== api-mgr api promote

----
> api-mgr api promote [options] <apiInstanceId> <sourceEnvId>
----

Promotes the API instance passed in `<apiInstanceId>` from the source environment in `<sourceEnvId>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `-a, --copyAlerts`
| Indicates whether to copy alerts. +
This option takes `true` or `false` values. Default Value is `true`

| `-p, --copyPolicies`
|Indicates whether to copy policies. +
This option takes `true` or `false` values. Default Value is `true`

| `-t, --copyTiers`
|Indicates whether to copy tiers. +
This option takes `true` or `false` values. Default Value is `true`
|===


=== api-mgr api redeploy

----
> api-mgr api redeploy [options] <apiInstanceId>
----

Redeploys the API Instance passed in `<apiInstanceId>` to the deployment target set up in the options described below.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `--target <id>`
| Hybrid or RTF deployment target ID.

| `--applicationName <name>`
| Application name.

| `--environmentName <name>`
| Target environment name. +
 Must be provided to redeploy APIs from unclassified environments.

| `--gatewayVersion <version>`
| CloudHub Gateway version.

| `--overwrite`
| Update application if exists. +
This option takes `true` or `false` values. Default Value is `true`
|===


=== api-mgr api undeprecate

----
> api-mgr api undeprecate [options] <apiInstanceId>
----

Undeprecates the API instance passed in `<apiInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr contract delete

----
> api-mgr contract delete [options] <apiInstanceId> <clientId>
----

This command deletes the contract between the API Instance passed in `<apiInstanceId>`, and the client passed in `<clientId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr contract list

----
> api-mgr contract list [options] <apiInstanceId> [searchText]
----

Lists all contracts of the API passed in `<apiInstanceId>`.

[TIP]
You can specify keywords in searchText to limit results to APIs containing those specific keywords.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a,a"]
|===
|Value |Description |Example
|`--limit` | Number of results to retrieve | `exchange asset list --limit 2`
|`--offset` | Offsets the amount of APIs passed | `api-mgr contract list --offset 3 643404`
|`--sort` | Sorts the results in the field name passed | `api-mgr contract list --sort "Latest Version" 643404`
|===

=== api-mgr policy apply

----
> api-mgr policy apply [options] <apiInstanceId> <policyId>
----

Applies the policy passed in `<policyId>` to the API instance passed in `<apiInstanceId>`.

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `--policyVersion <value>`
| Mule 4 policy version.

| `--groupId <value>`
| Mule 4 policy group ID. +
If no value is provided, this value defaults to MuleSoft group ID.

| `-c, --config [configJSON]`
| Pass the configuration data as a JSON string. +
For example, `api-mgr policy apply -c '{"property": "value"}'`

| `-p, --pointcut [dataJSON]`
| Pass pointcut data as JSON strings. +
For example `api-mgr policy apply (...) -p '[{"methodRegex":"GET|PUT","uriTemplateRegex":"/users*"}]'`
|===

=== api-mgr policy describe

----
> api-mgr policy describe [options] <policyId>
----

This command shows the description and available configuration properties of the policy passed in `<policyId>`. +

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `--policyVersion <value>`
| Mule4 policy version.

| `--groupId <value>`
| Mule4 policy group ID. +
Defaults to MuleSoft group ID when not provided.
|===


=== api-mgr policy disable

----
> api-mgr policy disable [options] <apiInstanceId> <policyId>
----

This command disables the policy passed in `<policyId>` from the API instance passed in `<apiInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr policy edit

----
> api-mgr policy edit [options] <apiInstanceId> <policyId>
----

This command edits the policy configuration passed in `<policyId>` of the API Instance passed in `<apiInstanceId>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `-c, --config [configJSON`]
| Pass the configuration data as a JSON string. +
For example, `api-mgr policy apply -c '{"property": "value"}'`

| `-p, --pointcut [dataJSON]`
| Pass pointcut data as JSON strings. +
For example `api-mgr policy apply (...) -p '[{"methodRegex":"GET|PUT","uriTemplateRegex":"/users*"}]'`
|===

=== api-mgr policy enable

----
> api-mgr policy enable [options] <apiInstanceId> <policyId>
----

This command enables the policy passed in `<policyId>` for the API Instance passed in `<apiInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr policy list

----
> api-mgr policy list [options] [apiInstanceId]
----

This command lists all policies for all APIs in API Manager 2.x. +
When the `[apiInstanceId]` parameter is specified, this command lists the policies applied to that API instance.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes the `-m, --muleVersion4OrAbove` option which takes `true` or `false` values. +


=== api-mgr policy remove

----
> api-mgr policy remove [options] <apiInstanceId> <policyId>
----

This command removes the policy specified in `<policyId>` from the API instance passed in `<apiInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr tier add

----
> api-mgr tier add [options] <apiInstanceId>
----

This command creates an SLA tier for the API instance passed in `<apiInstanceId>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `-a, --autoApprove`
| Indicates whether the SAL tier should be auto-approved. +
This command only takes `true` or `false` values.

| `--name <value>`
| Tier name

| `--description <value>`
| Tier description

| -l, --limit <value>
| -l, --limit | Single instance of an SLA tier limit in the form `--limit A,B,C` where:

* `A` is a boolean indicating whether or not this limit should be visible.
* `B` is a number of requests per "C" time period.
* `C` is the time period unit. Time period options are:
** `ms`(millisecond)
** `sec`(second)
** `min`(minute)
** `hr`(hour)
** `d`(day)
** `wk`(week)
** `mo`(month)
** `yr`(year)

For example: `--limit true,100,min` is a visible limit of 100 requests per minute. +

[TIP]
To create multiple limits, you can provide multiple `--limit` options. +
For example: `-l true,100,sec -l false,20,min`

|===


=== api-mgr tier copy

----
> api-mgr tier copy [options] <sourceAPIInstanceId> <targetAPIInstanceId>
----

This command copies the SLA tier from the API instance passed in `<sourceAPIInstanceId>` to the API instance Id passed in `<targetAPIInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr tier delete

----
> api-mgr tier delete [options] <apiInstanceId> <tierId>
----

This command deletes the SLA tier passed in `<tierId>` from API instance passed in `<apiInstanceId>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== api-mgr tier list
----
> api-mgr tier list [options] <apiInstanceId> [searchText]
----

This command lists the SLA tiers of the  API instance passed in `<apiInstanceId>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description | Example
|`--limit` | Number of results to retrieve | `api-mgr tier list --limit 2`
|`--offset` | Offsets the amount of APIs passed | `api-mgr tier list --offset 3`
|`--sort` | Sorts the results in the field name passed | `api-mgr tier list --sort "Latest Version"`
|===

=== datagraph load-balancer-config add

----
> datagraph load-balancer-config add <dlbUrl>
----
This command adds a dedicated load balancer configuration specified by `<dlbUrl>` to Anypoint DataGraph.
The `dlbUrl` is a valid URL that includes the DLB domain and the mapping rule `inputUri`.


// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== datagraph load-balancer-config describe

----
> datagraph load-balancer-config describe [options]
----

This command displays a dedicated load balancer URL for Anypoint DataGraph.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== datagraph load-balancer-config remove

----
> datagraph load-balancer-config remove [options]
----

This command removes a dedicated load balancer configuration from Anypoint DataGraph.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== designcenter project create

----
> designcenter project create [options] <name>
----

This Command creates a new Design Center project with the name specified in `<name>`.

[IMPORTANT]
This command does not support Mule application types.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30a,40a,30a"]
|===
|Command | Description |  Example
| `--type (required)` | The project type. +
This field is required.

Supported values are:

* `raml`
* `raml-fragment` | `designcenter project create --type raml`
| `--fragment-type` | The fragment type if the application type is a RAML fragment.

This field is required if the type option was set as `raml-fragment`

Supported fragments type are:

* `trait`
* `resource-type`
* `library`
* `type`
* `user-documentation` | `designcenter project create --type raml-fragment --fragment-type user-documentation`
|===

=== designcenter project delete

----
> designcenter project delete [options] <name>
----

This Command deletes the Design Center project specified in `name`.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== designcenter project download

----
> designcenter project download [options] <name> <targetDir>
----

This command downloads the Design Center project passed in `name` to your local directory specified in `targetDir`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== designcenter project publish

----
> designcenter project publish [options] <projectName>
----

This Command publishes the Design Center project passed in `projectName` to Exchange. +
Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[TIP]
Options that are not specified are extracted from exchange.json

[%header,cols="30a,40a,30a"]
|===
|Command | Description |  Example
| `--name` | The name for the asset | `designcenter project publish --name sampleProject`
| `--main` | The name of the main file name. | `designcenter project publish --main sample.xml`
| `--apiVersion` | The API version if your project is an API specification project. | `designcenter project publish --main sample.raml --apiVersion 1.0`
| `--tags` | Comma separated list of tags. | `designcenter project publish --tags test,sample,integration`
| `--groupId` | The asset's groupId. | `designcenter project publish --groupId com.mulesoft.com`
| `--assetId`  | The asset's assetId. | `designcenter project publish --assetId project`
| `--version` | The asset's version. | `designcenter project publish --version 1.0`
|===

=== designcenter project upload

----
> designcenter project upload [options] <name> <projDir>
----

This Command uploads a Design Center project from your local directory passed in `projDir` and names it using the name passed in `name`.

By default, this command ignores all hidden files and directories. To include hidden files and directories, use the `--include-dot-files` option. +
When the `--include-dot-files` option is used, the command uploads hidden files and folders from your specified directory.

Besides the `--include-dot-files`, this command takes the default `--help`, `-f`/`--fields` and `-o`/`--output` options.

=== designcenter project list

----
> designcenter project list [options] [searchText]
----

This Command lists all your Design Center projects. +
You can start typing your project's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30a,40a,30a"]
|===
|Command | Description |  Example
|`--pageIndex` | Number of page to retrieve | `designcenter project list --pageIndex 3`
|`--pageSize` | Number of results to retrieve per page | `designcenter project list --pageSize 5`
|===

=== exchange asset upload

----
> exchange asset upload [options] <assetIdentifier> [filePath]
----

This command uploads an OAS, RAML, WSDL, HTTP, or custom asset using the IDs passed in `<assetIdentifier>`. +
If `<filePath>` points to a ZIP archive file, that archive must include an `exchange.json` file describing the asset. +
Argument `assetIdentifier` should be formatted as follows: `<group_id>/<asset_id>/<version>`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also accepts:

[%header,cols="30a,40a,30a"]
|===
| Command | Description |  Example
| `--apiVersion` | Asset API version .4+<.<|
`exchange asset upload --apiVersion 1.0 --name testProject --classifier custom`

`exchange asset upload --mainFile 'api.yml'`
| `--name` |Asset name
| `--mainFile` | Main file of the API asset
| `--classifier` | Valid asset classifiers are `oas`, `raml`, `wsdl`, `http`, and `custom`.
|===

=== exchange asset uploadv2

----
> exchange asset uploadv2 [properties] <assetIdentifier>
----

This command uploads a rest-api, soap-api, http-api, raml-fragment, custom, app, template, example, policy, extension, external-library or connector asset using the ID passed in <assetIdentifier>.

Use the following format for the _assetIdentifier_ argument:

`([_groupID_]/)_assetID_/_version_`

If _group_id_ is not specified, it defaults to the currently selected organization ID.

[%header,cols="40a,30a,30a"]
|===
| Command | Description |  Example
| `--name` | Asset name (required if no pom file is specified) .3+|
`exchange asset uploadv2 --name "Raml Asset" --description "RAML" --properties.apiVersion v1 --properties.mainFile api.raml --files.raml.zip /..../file-path/raml.zip raml-asset/1.0.0`
| `--description` | Asset description
| `--properties` | Asset properties

For example:

* `properties.mainFile main.yaml`
* `properties.apiVersion v1`
* `properties.assetLink \http://api.com`

| `--files` | Asset file, identified as `classifier.packaging` or `packaging`, for example, `files.raml.zip .../file-path/raml.zip`

To send multiple files, use the same option multiple times:

`--files.custom.zip custom.zip --files.pom.xml pom.xml` | `exchange asset uploadv2 --files.mule-application.jar /..../file-path/mule-app.jar --files.pom /..../file-path/mule-app.pom fa7b266c-3817-4cbb-ae49-7f3cc6c8cd9e/my-mule-app/1.0.0`
| `--type` | Asset type

Required if no file is specified.

If it is uploaded, the type is inferred from the classifier of the file.

Supported Values:

* `rest-api`
* `soap-api`
* `http-api`
* `raml-fragment`
* `custom`
* `connector`
* `template`
* `example`
* `policy`
* `app`
* `extension`
* `external-library` |

| `--categories` | Categories |

`categories.someKey value`

`categories.anotherKey anotherValue`

| `--fields` | Fields |

`fields.someKey value`

`fields.anotherKey anotherValue`

| `--keywords` | Keywords (comma-separated) |


`raml,rest-api,someKeyword`

| `--tags` | Tags (comma-separated)|


`api,tag1,tag2`

| `--dependencies` | Asset dependencies (comma-separated) |

`groupID:assetID:version,groupID2:assetID:version` |
|===

=== exchange asset mutableDataUpload

----
> exchange asset mutableDataUpload [properties] <assetIdentifier>
----

This command modifies the mutable data of an already created asset, including tags, categories, fields, and documentation.

Use the following format for the _assetIdentifier_ argument:

`[_<groupID>_]/_<assetID>_/_<version>_`

If _group_id_ is not specified, it defaults to the currently selected organization ID.

[%header,cols="40a,30a,30a"]
|===
| Command | Description |  Example
| `--docs` | Documentation file. (Should specify the "zip" file path. Example: "--docs /.../file-path/docs.zip") |
`exchange asset mutableDataUpload --docs /Users/llucas/Desktop/examples/docs.zip --tags "tag1,tag2" --categories.beach sun --fields.central park fa7b266c-3817-4cbb-ae49-7f3cc6c8cd9e/asset-id/1.0.0`

| `--categories` | Categories |

`categories.someKey value`

`categories.anotherKey anotherValue`

| `--fields` | Fields |

`fields.someKey value`

`fields.anotherKey anotherValue`

| `--tags` | Tags (comma-separated)|

`api,tag1,tag2`

|===

=== exchange asset modify

----
> exchange asset modify [options] <assetIdentifier>
----

This command modifies the Exchange asset identified with `<assetIdentifier>`. +
Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30a,40a,30a"]
|===
|Command | Description |  Example
|`--name` | New asset name .2+<.<| `exchange asset modify --name newName --tags test,sample`
|`--tags` | Comma-separated tags for the asset
|===

=== exchange asset download

----
> exchange asset download [options] <assetIdentifier> <directory>
----

This command downloads the Exchange asset identified with `<assetIdentifier>` to the directory passed in `<directory>`. +
Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset list

----
> exchange asset list [options] [searchText]
----

This command lists all assets in Exchange.

[TIP]
You can specify keywords in searchText to limit results to APIs containing those specific keywords.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30a,40a,30a"]
|===
|Command | Description |  Example
|`--limit` | Number of results to retrieve | `exchange asset list --limit 2`
|`--offset` | Offsets the number of APIs passed | `exchange asset list --offset 3`
|`--sort` | Sorts the results in the field name passed | `exchange asset list --sort "Latest Version"`
|`--organizationId` | Filters by organization id | `exchange asset list --organizationId a12b3c45-de6f-789g-hi01-j2klm3nop4q5`
|===


=== exchange asset page download

----
> exchange asset page download [options] <assetIdentifier> <directory> [pageName]
----

This command downloads the description page specified in `<pageName>` for the Exchange asset identified with `<assetIdentifier>` to the directory passed in `<directory>`. +
If [pageName] is not specified, this command downloads all pages.

[NOTE]
This command only supports published pages.

Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID. +
The description page in downloaded in Markdown format. When `name` is not specified, all pages are downloaded.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset page modify

----
> exchange asset page modify [options] <assetIdentifier> <pageName>
----

This command modifies the description page specified in `<pageName>`, for the Exchange asset identified with `<assetIdentifier>`.

[NOTE]
This command only supports published pages.

Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID. +
Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes the `--name` option to set a new asset page name.

=== exchange asset page upload

----
> exchange asset page upload [options] <assetIdentifier> <pageName> <mdPath>
----

This command uploads an asset description page from the path passed in `<mdPath>` using the name specified in `<pageName>` to the Exchange asset identified with `<assetIdentifier>`. +
Naming the page "home" makes the uploaded page the main description page for the Exchange asset.

[CAUTION]
This command publishes all active drafts as part of the operation.

Argument `assetIdentifier` should be formatted as follows: `[group_id]/<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID. +
// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset page update

----
> exchange asset page update [options] <assetIdentifier> <pageName> <mdPath>
----

This command updates the content of an asset description page from the path passed in `<mdPath>` using the name specified in `<pageName>` to the Exchange asset identified with `<assetIdentifier>`. +
Naming the page "home" makes the updated page the main description page for the Exchange asset.

[CAUTION]
This command publishes all active drafts as part of the operation.

Argument `assetIdentifier` should be formatted as follows: `[group_id]/<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID. +
// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset page delete

----
> exchange asset page delete [options] <assetIdentifier> <pageName>
----

This command deletes the description page specified in `<pageName>`, for the asset identified with `<assetIdentifier>`. +

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

[NOTE]
This command only supports published pages.

Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID. +
// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset page list

----
> exchange asset page list <assetIdentifier>
----

This command lists all pages for the asset passed in `<assetIdentifier>`. +
Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

[NOTE]
This command only supports published pages.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]


=== exchange asset copy

----
> exchange asset copy [options] <source> <target>
----

This command copies the Exchange asset from `<source>` to `<target>`. +
Arguments `<source>` and `<target>` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

This command accepts the default options `--help`, `-f/--fields`, and `-o/--output`, and also:

[%header,cols="30a,40a,30a"]
|===
| Command | Description |  Example
|`--targetOrganizationId` | Organization ID to copy asset into | `exchange asset copy --targetOrganizationId organization_id source_group_id/source_asset_id/source_version target_group_id/target_asset_id/target_version`
|===

=== exchange asset delete

----
> exchange asset delete [options] <assetIdentifier>
----

This command deletes the Exchange asset passed in `<assetIdentifier>`.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID. +
// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset deprecate

----
> exchange asset deprecate <assetIdentifier>
----

This command deprecates the asset passed in `<assetIdentifier>`.

Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset undeprecate

----
> exchange asset undeprecate <assetIdentifier>
----

This command undeprecates the asset passed in `<assetIdentifier>`.

Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset describe

----
> exchange asset describe <assetIdentifier>
----

This command describes the asset passed in `<assetIdentifier>`.

Argument `assetIdentifier` should be formatted as follows: `([group_id]/)<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset resource upload

----
> exchange asset resource upload [options] <assetIdentifier> <filepath>
----

This command uploads the resource specified in `<filepath>` to a page in the asset portal described in `<assetIdentifier>`.

You can use this command for any page of your `<assetIdentifier>` asset.

Supported file extensions for `<filepath>` are: `jpeg`, `jpg`, `jpe`, `gif`, `bmp`, `png`, `webp`, `ico`, `svg`, `tiff`, `tif`.

The argument `assetIdentifier` should be formatted as follows: `[group_id]/<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

The successful output command will be a markdown codesnippet.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset resource list

----
> exchange asset resource list [options] <assetIdentifier>
----

This command lists the resources in the asset portal of the asset specified in `<assetIdentifier>`.

Argument `assetIdentifier` should be formatted as follows: `[group_id]/<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

[NOTE]
This command lists published resources by default. +
You can use the `--draft` option to list draft resources from the asset portal.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes the `--draft` option to list non-published resources in the asset portal.

=== exchange asset resource download

----
> exchange asset resource download [options] <assetIdentifier> <resourcePath> <filePath>
----

This command downloads the published resource specified in `<resourcePath>` from the asset portal of the asset specified in `<assetIdentifier>` to the file specified in `<filePath>`.

Argument `assetIdentifier` should be formatted as follows: `[group_id]/<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

Argument `<resourcePath>` must be a published resource. +
You can list all published resources using the <<exchange asset resource list,asset resource list>> command.

[NOTE]
This command only supports published resources.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== exchange asset resource delete

----
> exchange asset resource delete [options] <assetIdentifier> <resourcePath>
----

This command deletes the resource specified in `<resourcePath>` from the asset portal of the asset specified in `<assetIdentifier>` by publishing a new portal in which `resourcePath` has been deleted.

Argument `<assetIdentifier>` should be formatted as follows: `[group_id]/<asset_id>/<version>`. +
If `group_id` is not specified, it defaults to the currently selected Organization ID.

Argument `<resourcePath>` must be a published resource. +
You can list all published resources using the <<exchange asset resource list,asset resource list>> command.

[CAUTION]
This command publishes all active drafts as part of the operation.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-alert list

----
> runtime-mgr cloudhub-alert list [options]
----
This command lists all alerts associated with your current environment.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-alert-history describe

----
> runtime-mgr cloudhub-alert-history describe [options] <name>
----
This command describes the history of the alarm passed in `<name>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-application list

----
> runtime-mgr cloudhub-application list [options]
----

This command lists all applications available in your Anypoint Platform CLI. It returns your application name, its status, the number of vCores assigned and the last time it was updated.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-application describe

----
> runtime-mgr cloudhub-application describe [options] <name>
----

This command displays information on the application you pass in `<name>`. +
You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
The command returns data such as the application's domain, its status, the last time it was updated, the Mule version, the ZIP file name, the region, monitoring, and workers; as well as `TRUE` or `FALSE` information for persistent queues and static IPs enablement.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-application describe-json

----
> runtime-mgr cloudhub-application describe-json  [options] <name>
----

This command returns the raw JSON response of the application you specify in `<name>`.

You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-application stop

----
> runtime-mgr cloudhub-application stop  [options] <name>
----

This command stops the running application you specify in `<name>` +
You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-application start

----
> runtime-mgr cloudhub-application start [options] <name>
----

This command starts the running application you specify in `<name>` +
You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-application restart

----
> runtime-mgr cloudhub-application restart  [options] <name>
----

This command restarts the running application you specify in `<name>` +
You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-application delete

----
> runtime-mgr cloudhub-application delete [options] <name>
----

This command deletes the running application you specify in `<name>`.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

[[deploy-to-cloudhub]]
=== runtime-mgr cloudhub-application deploy

----
> runtime-mgr cloudhub-application deploy  [options] <name> <zipfile>
----

This command deploys the Mule deployable archive ZIP file that you specify in `<zipfile>` using the name you set in `<name>`. +
You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
You will have to provide the absolute or relative path to the deployable ZIP file in your local hard drive and the name you give to your application has to be unique.

[NOTE]
If successful, this command's output includes the deployment status of `UNDEPLOYED`,
which indicates that CloudHub uploaded the application successfully.

The options this command can take are:
[%header,cols="30a,70a"]
|===
|Option |Description
|--runtime                                   | Name and version of the runtime environment. +
Use this option to specify the name and version of the runtime you want to deploy. +
Some examples of this value are `2.1.1-API-Gateway`, `3.9.1-visualizer` or   `4.1.1`. +
Tap your `tab` key after this option for the CLI to show you all your available options.
(This value is the latest CloudHub Runtime version by default.)
|--workers                                      | Number of workers. (This value is '1' by default)
|--workerSize                               | Size of the workers in vCores. (This value is '1' by default)
|--region                                        | Name of the region to deploy to. +
For a list of all supported regions, use the <<cloudhub region list>> command.
|--property                                    | Set a property (`name:value`). Can be specified multiple times. +
The property to be set must be passed enclosed in quotes and characters `:` and `=` must be escaped. +
(e.g. `--property "salesforce.password:qa\=34534"`).

Character `:` is not supported for the property's name.
|--propertiesFile                        | Overwrite all properties with values from this file. The file format is 1 or more lines in `name:value` format. Set the absolute path of the properties file in your local hard drive.
|--persistentQueues                   | Enable or disable persistent queues. Can take `true` or `false` values. (This value is `false` by default)
|--persistentQueuesEncrypted  | Enable or disable persistent queue encryption. Can take `true` or `false` values. (This value is `false` by default)
|--staticIPsEnabled                                      | Enable or disable static IPs. Can take `true` or `false` values. (This value is `false` by default)
|--objectStoreV1                   | Enable or disable Object Store V1. Can take `true` or `false` values
|--autoRestart                            | Automatically restart app when not responding. Can take `true` or `false` values. (This value is `true` by default.)
|--help                                                  | output usage information
|===
Note that from Anypoint Platform CLI you won't be able to allocate static IPs. You can simply enable and disable them.

After typing any option, you can double tap the `tab` key for a full list of all possible options.
For example:
----
> deploy <app name> --runtime [tab][tab]
----
Lists all possible runtimes you can select.

[IMPORTANT]
====
If you deploy without using any options, your application will deploy using all your default values.
====

=== runtime-mgr cloudhub-application modify

----
> runtime-mgr cloudhub-application modify  [options] <name> [zipfile]
----
This command updates the settings of an existing application. Optionally you can update it by uploading a new ZIP file. +
You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.
This command can take all the same options as the `deploy` option.

[NOTE]
This command's output includes `Status`, which is the application's previous deployment status state.

You can also start typing your option and press `tab` for Anypoint Platform CLI to autocomplete it for you.

//TODO Check revert-runtime deprecation
// === runtime-mgr application revert-runtime
//
// [source,Example]
// ----
// > runtime-mgr application revert-runtime [options] <name>
// ----
// This command reverts the application defined in `<name>` to its previous runtime environment. +
// You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
// include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cloudhub-application download-logs

----
> runtime-mgr cloudhub-application download-logs [options] <name> <directory>
----
This command downloads logs the for application specified in `<name>` to the specified directory.

You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

Keep in mind that contrarily to what you see in the UI, the logs you download from the CLI won't separate system logs from worker logs.

=== runtime-mgr cloudhub-application tail-logs

----
> runtime-mgr cloudhub-application tail-logs [options] <name>
----

This command tails application logs. +
You can start typing your application's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

// === runtime-mgr cloudhub-application upgrade-runtime
//
// [source,Example]
// ----
// > runtime-mgr cloudhub-application upgrade-runtime [options] <name>
// ----
//
// This command upgrades the runtime version of the application passed in `name` to the latest patch version. If the `-v`/`--version` option is used to specify a specific runtime version, this command updates the application's runtime to that version. +
// Besides the `--version` option, this command also takes the default `--help`, `-f`/`--fields` and `-o`/`--output` options.
//
// === runtime-mgr cloudhub-application downgrade-runtime
//
// [source,Example]
// ----
// > runtime-mgr cloudhub-application downgrade-runtime [options] <name>
// ----
// This command downgrades the runtime version of the application passed in `name` to the previous runtime version. If the `-v`/`--version` option is used to specify a specific runtime version, this command updates the application's runtime to that version. +
// Besides the `--version` option, this command also takes the default `--help`, `-f`/`--fields` and `-o`/`--output` options.

=== runtime-mgr cloudhub-application copy

----
> runtime-mgr cloudhub-application copy [options] <source> <target>
----

This command copies the CloudHub application passed in `source` to the target passed in `target`.

Arguments `source` and `target` should be formatted as follows: `([group_id]/)<asset_id>/<version>`.

If `group_id` is not specified, it defaults to the currently selected Organization ID.

For example:

----
> runtime-mgr cloudhub-application copy Services:QA/application-1 Development:QA/application-2
----
Copies the application named `application-1` from the QA environment of the Services organization to the QA environment of the Development organization. +
If the Anypoint Platform CLI is using the QA environment in the Services organization, the command can simply take the application name as a `source`:

----
> runtime-mgr cloudhub-application copy application-1 Development/QA/application-2
----

[NOTE]
Running this command requires your user to have read/write access to the `/tmp` directory of the OS where CLI is installed.

In addition to the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30a,70a"]
|===
|Option |Description
|--property  | Set a property (`name:value`). Can be specified multiple times.

Enclose the property in quotes and escape the `:` and `=` characters,
for example:

`--property "salesforce.password:qa\=34534"`
|===

[NOTE]
When copying an application containing safely hidden application properties, pass the properties in the `copy` command using the `--property` option.
//HIDDEN PROPS XREF
include::partial$hidden-props.adoc[tag=hidePropsXref]

=== runtime-mgr rtf list

----
> runtime-mgr rtf list [options]
----

This command lists available Runtime Fabric instances.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

For information about managing your Runtime Fabric instances using the command line, see
xref:runtime-fabric::install-rtfctl.adoc#supported-commands[Supported rtfctl Commands].

=== runtime-mgr standalone-application artifact

----
> runtime-mgr standalone-application artifact [options] <identifier> <directory>
----

This command downloads the application artifact of the `identifier` application, to the directory passed in `directory`.
The `identifier` parameter can be either an application ID or name.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr standalone-application deploy

----
> runtime-mgr standalone-application deploy [options] <targetIdentifier> <name> <zipfile>
----

This command deploys or redeploys the application passed as a ZIP file in the path `zipfile` to the on-premises target passed in `targetIdentifier`.

The `targetIdentifier` parameter can be either a target ID or name.

A target can be either a server, server group, or cluster.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

To redeploy an app and set a logging level or turn on Insight event tracking, see <<runtime-mgr standalone-application modify>>.

=== runtime-mgr standalone-application describe-json

----
> runtime-mgr standalone-application describe-json [options] <identifier>
----

This command describes the standalone (on-premises) application passed in `identifier` as a raw JSON response.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr standalone-application modify

----
> runtime-mgr standalone-application modify [options] <identifier> <zipfile>
----

This command modifies the standalone (on-premises) application passed in `identifier` with the ZIP file application passed in `zipfile` as a path.

The `identifier` parameter specifies the application identifier.
To retrieve the identifier, see
xref:anypoint-platform-cli-commands.adoc#runtime-mgr-standalone-application-list[runtime-mgr standalone-application list].

In addition to the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30,50a"]
|===
|Value |Description
| `--insight` | Stores message metadata of every Mule transaction.
| `--log [level:scope]` | Sets the logging level and scope pair:

* `level`: TRACE, DEBUG, INFO, WARN, ERROR, FATAL, or OFF
* `scope`: package name of the class, connector, or module to log, such as `org.mule.extension.ftp` for Anypoint Connector for FTP

To set multiple logging levels, provide multiple `--log` options, for example, `--log INFO:org.apache --log WARN:org.mule`.
|===


=== runtime-mgr standalone-application start

----
> runtime-mgr standalone-application start [options] <identifier>
----

This command starts the standalone (on-premises) application passed in `identifier`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr standalone-application delete

----
> runtime-mgr standalone-application delete [options] <identifier>
----

This command deletes the standalone (on-premises) application passed in `identifier`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

=== runtime-mgr standalone-application describe

----
> runtime-mgr standalone-application describe [options] <identifier>
----

This command shows detailed information, such as status, creation date, and last update, for the standalone (on-premises) application passed in `identifier`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr standalone-application list

----
> runtime-mgr standalone-application list [options]
----

This command lists all standalone (on-premises) applications.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header%autowidth.spread,cols="a,a"]
|===
|Value |Description
| `--limit <num>` | Specifies the number of results to retrieve
| `--offset <num>`      | Offsets the number of applications passed
|===


=== runtime-mgr standalone-application restart

----
> runtime-mgr standalone-application restart [options] <identifier>
----

This command restarts the standalone (on-premises) application passed in `identifier`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr standalone-application stop

----
> runtime-mgr standalone-application stop [options] <identifier>
----

This command stops the standalone (on-premises) application passed in `identifier`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr standalone-application copy

----
> runtime-mgr standalone-application copy [options] <source> <target> <targetIdentifier>
----

This command copies the standalone (on-premises) application passed in `source` to the target passed in `target` and the server, server group or cluster ID or Name passed in `targetIdentifier`.

Both arguments `source` and `destination` are represented using the format: `<organizationName>:<environmentName>/<appName>`, for example:

----
> runtime-mgr standalone-application copy Services:QA/application-1 Development:QA/application-2 123456
----
Copies the application named `application-1` from the QA environment of the _Services_ organization to the QA environment of the `_Development_` organization in the server ID 123456.

If the Anypoint Platform CLI is using the QA environment in the Services organization, the command can simply take the application name as a `source`:

----
> runtime-mgr standalone-application copy application-1 Development/QA/application-2 123456
----

[NOTE]
Running this command requires for your user to have read/write access to the `/tmp` directory of the OS where the CLI is installed.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]



=== runtime-mgr server describe

----
> runtime-mgr server describe [options] <serverId>
----

This command describes the server passed in `serverId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr server modify

----
> runtime-mgr server modify [options] <serverId>
----

This command modifies the server passed in `serverId`.

In order to update the id for the cluster, you need to pass the  `--name` option.

Besides the `--name` option, this command also takes the default `--help`, `-f`/`--fields` and `-o`/`--output` options.

=== runtime-mgr server token

----
> runtime-mgr server token [options]
----

This command gets server registration token. This token needs to be used to register a new server.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr server delete

----
> runtime-mgr server delete [options] <serverId>
----

This command deletes the server passed in `serverId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

=== runtime-mgr server list

----
> runtime-mgr server list [options]
----

This server lists all servers in your environment.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

// TODO: Deprecated server register
// === runtime-mgr server register
//
// [source,Example]
// ----
// > runtime-mgr server register [options] <name> <directory>
// ----
//
// This command registers a new server with the name passed in `name`. This command returns a signed certificate which is downloaded to `directory` path.
//
// Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:
//
// [%header,cols="30,70"]
// |===
// |Value |Description
// | --signature <signatureStr> | Signature for Sign Certificate Request.
// | --mule <version> | Mule version
// | --gateway <version> | Gateway version
// |===

=== runtime-mgr serverGroup create

----
> runtime-mgr serverGroup create [options] <name> [serverIds...]
----

This command creates a server group with the name passed in `name` using the server Id(s) passed as argument(s) thereafter.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr serverGroup describe

----
> runtime-mgr serverGroup describe [options] <serverGroupId>
----

This command describes the server group passed in `serverGroupId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr serverGroup modify

----
> runtime-mgr serverGroup modify [options] <serverGroupId>
----

This command modifies the server group passed in `serverGroupId`.

In order to update the id for the cluster, you need to pass the  `--name` option.

Besides the `--name` option, this command also takes the default `--help`, `-f`/`--fields` and `-o`/`--output` options.


=== runtime-mgr serverGroup add server

----
> runtime-mgr serverGroup add server [options] <serverGroupId> <serverId>
----

This command adds the server passed in `serverId` to the server group passed in `serverGroupId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr serverGroup delete

----
> runtime-mgr serverGroup delete [options] <serverGroupId>
----

This command deletes the server groups passed in `serverGroupId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

=== runtime-mgr serverGroup list

----
> runtime-mgr serverGroup list [options]
----

This command lists all server groups in the environment.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr serverGroup remove server

----
> runtime-mgr serverGroup remove server [options] <serverGroupId> <serverId>
----

This command removes the server passed in `serverId` from the server group passed in `serverGroupId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cluster add server

----
> runtime-mgr cluster add server [options] <clusterId> <serverId>
----

This command adds the cluster in `clusterId` to the server passed in `serverId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cluster delete

----
> runtime-mgr cluster delete [options] <clusterId>
----

This command deletes the cluster passed in `clusterId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

=== runtime-mgr cluster list

----
> runtime-mgr cluster list [options]
----

This command lists all clusters in the environment.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cluster remove server

----
> runtime-mgr cluster remove server [options] <clusterId> <serverId>
----

This command removes the server passed in `serverId` from the cluster passed in `clusterId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cluster create

----
> runtime-mgr cluster create [options] <name>
----

This command creates a cluster using the id passed in `name`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:
[%header,cols="30,70"]
|===
|Value | Description
|`--multicast` | Whether cluster should be multicast
|`--server <id:ip>` | Pair of server ID and IP address. Latter is optional for multicast cluster. Provide multiple values to add multiple servers
|===

=== runtime-mgr cluster describe

----
> runtime-mgr cluster describe [options] <clusterId>
----

This command describes the cluster passed in `clusterId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr cluster modify

----
> runtime-mgr cluster modify [options] <clusterId>
----

This command modifies the cluster passed in `clusterId`. +
In order to update the id for the cluster, you need to pass the  `--name` option.

Besides the `--name` option, this command also takes the default `--help`, `-f`/`--fields` and `-o`/`--output` options.




=== runtime-mgr standalone-alert describe

----
> runtime-mgr standalone-alert describe [options] <alertId>
----

This command describes the alert passed in `alertId`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== runtime-mgr standalone-alert create

----
> runtime-mgr standalone-alert create [options] <name>
----

This command creates a new alert for a standalone runtime with the ID passed in `name`.
The alert `name` is limited to 256 characters.


Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30,70"]
|===
|Value |Description
| `--severity <val>` | Alert severity
| `--resourceType <type>` | Alert resource type
| `--resource [id]` | Alert resource ID. Can be used multiple types. If not provided alert triggers for all resources. Depending on `resourceType` resource can be application, server, server-group or cluster.
| `--condition <val>` | Alert trigger condition
| `--period [minutes]` | Condition duration in minutes
| `--threshold [num]` | Condition threshold number
| `--operator [type]` | Condition operator explaining values relation to threshold.
| `--subject <string>` | Alert notification email subject
| `--content <string>` | Alert notification email body
| `--recipient [username]` | Username to send alert notification to. Can be used multiple times to specify up to 20 platform user IDs.
| `--email [emailAddress]` | Email address to send alert notification to. Can be used multiple times to specify up to 20 email addresses.
|===

=== runtime-mgr standalone-alert modify

----
> runtime-mgr standalone-alert modify [options] <alertId>
----

This command modifies the alert passed in `alertId`.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30,70"]
|===
|Value |Description
| `--name <value>` | Alert name
| `--severity <value>` | Alert severity
| `--resourceType <type>` | Alert resource type
| `--resource [id]` | Alert resource ID. Can be used multiple types. If not provided alert triggers for all resources. Depending on `resourceType` resource can be application, server, server-group or cluster.
| `--condition <value>` | Alert trigger condition
| `--period [minutes]` | Condition duration in minutes
| `--threshold [num]` | Condition threshold number
| `--operator [type]` | Condition operator explaining values relation to threshold.
| `--subject <string>` | Alert notification email subject
| `--content <string>` | Alert notification email body
| `--recipient [username]` | Username to send alert notification to. Can be used multiple times to specify up to 20 platform user IDs.
| `--email [emailAddress]` | Email address to send alert notification to. Can be used multiple times to specify up to 20 email addresses.
|===

=== runtime-mgr standalone-alert list

----
> runtime-mgr standalone-alert list [options]
----

This command lists all alerts for standalone Mules in the current environment.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]



=== cloudhub load-balancer list

----
> cloudhub load-balancer list [options]
----
This command lists all load balancers in your Anypoint Platform. It displays load balancer's name, domain, its state, and the Anypoint VPC ID to which the load balancer is bound.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub load-balancer describe

----
> cloudhub load-balancer describe [options] <name>
----
This command displays information about the load balancer that is specified in `<name>`.

You can start typing your load balancer's name and press`tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

It displays load balancer's name, domain, its state and the Anypoint VPC Id to which the load balancer is bound.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub load-balancer describe-json

----
> cloudhub load-balancer describe [options] <name>
----
This command displays a raw JSON response from the load balancer that is specified in `<name>`.

You can start typing your load balancer's name and press`tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub load-balancer create

----
> cloudhub load-balancer create [options] <vpc> <name> <certificate> <privateKey>
----
This command creates a load balancer using the specified values in the variables.
[%header,cols="12,53a,35a"]
|===
|Value |Description |Example
| `vpc` |Name of the Anypoint VPC to which this load balancer is bound. +
If your Anypoint VPC name contains spaces, you need to pass it between ´"´ characters. | `vpc-demo`
| `name` |Name for the load balancer. | `newtestloadbalancer`
| `certificate` |Absolute path to the `.pem` file of your server certificate in your local hard drive. +
Your certificate files need to be PEM encoded and not encrypted. | `/Users/mule/Documents/cert.pem`
| `privateKey` |Absolute path to the `.pem` file of your private key of the server certificate in your local hard drive. +
Your private key file needs to be passphraseless. | `/Users/mule/Documents/privateKey.pem`
|===

[CAUTION]
--
The name for the load balancer that you pass in `<name>` must be unique. +
By default, your load balancer listens external requests on HTTPS and communicates with your workers internally through HTTP. +
If you configured your Mule application within the Anypoint VPC to listen on HTTPS, make sure you set `upstreamProtocol` to HTTPS when creating the mapping list using the <<cloudhub-load-balancer-mappings-add,load-balancer mappings add>> command.
--

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30a,70a"]
|===
|Value |Description
|`http` | Specifies the Load balancer HTTP behavior. It can be set to `on` (accepts HTTP requests and forwards it to your configured default `_sslendpoint_`), `off` (refuses all HTTP requests), or `redirect` (redirects to HTTPS).
|`clientCertificate` | Client certificate file
|`verificationMode`  | Specifies the client verification mode. It can be set to `on` (verify always), `off` (don't verify), or `optional` (verification optional).
|`crl` | Certificate revocation list file
|`tlsv1`  | Supports TLSv1 in addition to TLSv1.1 and TLSv1.2
|`dynamic-ips` | Uses dynamic IPs, which are not persistent through restarts
|===

[NOTE]
CloudHub does not implement the Online Certificate Status Protocol (OCSP). To keep your certification revocation list up to date, it's recommended to use the https://anypoint.mulesoft.com/exchange/portals/anypoint-platform/f1e97bc6-315a-4490-82a7-23abe036327a.anypoint-platform/cloudhub-api/[CloudHub API] to update your certificates programmatically.

Further configuration information can be found in the xref:cloudhub-dedicated-load-balancer.adoc#managing-certificates[certificates section] of the dedicated xref:cloudhub-dedicated-load-balancer.adoc[load balancer] page.

=== cloudhub load-balancer start

----
> cloudhub load-balancer start [options] <name>
----
This command starts the load balancer specified in `<name>`. +
This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`


=== cloudhub load-balancer stop

----
> cloudhub load-balancer stop [options] <name>
----
This command stops the load balancer specified in `<name>`. +
This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== cloudhub load-balancer delete

----
> cloudhub load-balancer delete [options] <name>
----

This command deletes the load balancer specified in `<name>`.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== cloudhub load-balancer ssl-endpoint add

----
> cloudhub load-balancer ssl-endpoint add [options] <name> <certificate> <privateKey>
----
This command adds an SSL endpoint to the load balancer specified in `<name>`, using the certificate and private key passed.

[%header,cols="12a,53a,35a"]
|===
|Value |Description |Example
| `name` |Name for the load balancer. | `newtestloadbalancer`
| `certificate` |Absolute path to the `.pem` file of your certificate in your local hard drive. +
Your certificate files need to be PEM encoded and not encrypted. | `/Users/mule/Documents/cert.pem`
| `privateKey` |Absolute path to the `.pem` file of your private key in your local hard drive. +
Your private key file needs to be passphraseless. | `/Users/mule/Documents/privateKey.pem`
|===

[NOTE]
CloudHub does not implement the Online Certificate Status Protocol (OCSP). To keep your certification revocation list up to date, it's recommended to use the https://anypoint.mulesoft.com/exchange/portals/anypoint-platform/f1e97bc6-315a-4490-82a7-23abe036327a.anypoint-platform/cloudhub-api/[CloudHub API] to update your certificates programmatically.

Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="15a,85a"]
|===
|Value |Description
|clientCertificate | Client certificate file
|verificationMode  | Specifies the client verification mode. It can be set to `on` (verify always) `off` (don't verify) or `optional` (Verification optional).
|crl | Certificate Revocation List file
|tlsv1  | Supports TLSv1 in addition to TLSv1.1 and TLSv1.2
|===

For more configuration information, see xref:lb-ssl-endpoints.adoc[Configure SSL Endpoints and Certificates].

=== cloudhub load-balancer ssl-endpoint remove

----
> cloudhub load-balancer ssl-endpoint remove [options] <name> <certificateName>
----
This command removes the ssl certificate specified in `<certificateName>` from the load balancer specified in `<name>`.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== cloudhub load-balancer ssl-endpoint set-default

----
> cloudhub load-balancer ssl-endpoint set-default [options] <name> <certificateName>
----
This command sets the certificate specified in `<certificateName>` as the default  certificate for the load balancer passed in `<name>`. +

You can start typing your load balancer's name and press`tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="30a,70a"]
|===
|Value |Description
|`http` | Specifies the Load balancer HTTP behavior
|===

=== cloudhub load-balancer ssl-endpoint describe

----
> cloudhub load-balancer ssl-endpoint describe [options] <name> <certificateName>
----
This command shows information about the configuration of the load balancer passed in `<name>` for the the certificate specified in `<certificateName>`. +
You can start typing your load balancer's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +

This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== cloudhub load-balancer whitelist add

----
> cloudhub load-balancer whitelist add [options] <name> <cidrBlock>
----
This command adds a range of IP addresses specified in `<cidrBlock>` to the allowlist of the load balancer specified in `<name>`.

[NOTE]
The allowlist works at the load balancer level, not at the CN certificate level. Make sure you only pass IP addresses formatted in https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing#IPv4_CIDR_blocks[CIDR notation].

You can start typing your load balancer's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== cloudhub load-balancer whitelist remove

----
> cloudhub load-balancer whitelist remove <name> <cidrBlock>
----
This command removes an IP or range of IPs addresses specified in `<cidrBlock>` to the allowlist of the load balancer specified in `<name>`.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== cloudhub load-balancer mappings describe

----
> cloudhub load-balancer mappings describe <name> [certificateName]
----
This command lists the mapping rules for the load balancer specified in `<name>`. +
If no `certificateName` is passed, Anypoint Platform CLI returns the mappings for the default SSL endpoint.

This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== cloudhub load-balancer mappings add

----
> cloudhub load-balancer mappings add [options] <name> <index> <inputUri> <appName> <appUri> [certificateName]
----
This command adds a proxy mapping rule to the load balancer specified in `<name>` at the priority index specified in `<index>` in the CN passed under the `certificateName` option. +
If no `certificateName` is passed, Anypoint Platform CLI adds the mappings to the default SSL endpoint.


[%header,cols="12a,68a,20a"]
|===
|Value |Description |Example
|`name` |Name of the load balancer to which this rule is applied. |`testloadbalancer`
|`index` |Priority of the rule.  |1
|`inputUri` |Name of the URI of your input URL |example.com
|`appName` |Name of the app of your output URL to which the request is forwarded |`{app}-example`
|`appUri` |URI of the app of your output URL to which the request is forwarded |/
|===

For the values in the example above, for an input call to `my-superapp.api.example.com/status?limit=10`, the endpoint `my-superapp-example: /status?limit=10` will be called for the application.

This command also takes the `--upstreamProtocol` option.
The `--upstreamProtocol` option sets the protocol used by your application to communicate internally with your load balancer. If no upstream protocol is set, HTTP is used as default.

[%header,cols="25a,60a"]
|===
| Option | Description
| `--upstreamProtocol <protocol>` | Look for upstream applications in HTTP port 8091 or HTTPS port 8092.
Supported Values: `http`, `https`
| `--certificateName <certificate name>` | Optional parameter
|===

=== cloudhub load-balancer mappings remove

----
> cloudhub load-balancer mappings remove [options] <name> <index> [certificateName]
----
This command removes the proxy mapping rules from the load balancer specified in `<name>` at the priority index specified in `<index>` and the CN specified as the `certificateName` option.

This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`
If no `certificateName` is passed, Anypoint Platform CLI removes the mappings for the default SSL endpoint.

=== cloudhub load-balancer dynamic-ips enable

----
> cloudhub load-balancer dynamic-ips enable [options] <name>
----
This command enables dynamic IPs for the load balancer specified in `<name>`.
This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`

=== cloudhub load-balancer dynamic-ips disable

----
> cloudhub load-balancer dynamic-ips disable [options] <name>
----
This command disables dynamic IPs for the load balancer specified in `<name>`.
This command does not take any options, except for the default ones: `--help`, `-f`/`--fields` and `-o`/`--output`


=== cloudhub region list

----
> cloudhub region list [options]
----
This command lists all supported regions.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub runtime list
----
> cloudhub runtime list [options]
----
This command lists all supported runtimes.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub vpc list

----
> cloudhub VPC list [options]
----
This command lists all available Anypoint VPCs. It returns ID, region, and environment of the network and whether it is the default Anypoint VPC or not.

=== cloudhub vpc describe

----
> cloudhub vpc describe [options] <name>
----
This command displays information about the Anypoint VPC that is specified in `<name>`.

You can start typing your Anypoint VPC's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub vpc describe-json

----
> cloudhub vpc describe [options] <name>
----
This command displays a raw JSON response of the Anypoint VPC that is specified in `<name>`.

You can start typing your Anypoint VPC's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub vpc create

----
> cloudhub vpc create [options] <name> <region> <cidrBlock> [environments...]
----
This command creates an Anypoint VPC using the name in `<name>`, in the region specified in `<region>`, with the xref:virtual-private-cloud.adoc#size-your-vpc[size] passed in `<cidrBlock>` in the form of a Classless Inter-Domain Routing (CIDR) block, using https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing#IPv4_CIDR_blocks[CIDR notation] and associates it to the xref:access-management::environments.adoc[environment(s)] passed as argument(s) thereafter.

[NOTE]
An Anypoint VPC needs to be bound to a business group within your organization. When creating an Anypoint VPC, make sure to assign it a business group using the <<cloudhub vpc business-groups add, business-groups add>> command.

Besides the default `--help` option, this command also takes the `--default` option. When passed, the Anypoint VPC is created as the default Anypoint VPC for the selected environment.

=== cloudhub vpc delete

----
> cloudhub vpc delete <name>
----
This command deletes the Anypoint VPC specified in `<name>`.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub vpc environments add

----
> cloudhub vpc environments add [options] <vpc> [environments...]
----
This command assigns the Anypoint VPC defined in `<vpc>` to the environment(s) passed as argument(s) thereafter. +
The `--default` option allows setting an Anypoint VPC as the default for the organization, which applies to all environments which don't have an Anypoint VPC explicitly associated.

This command also takes the default `--help` option.

=== cloudhub vpc environments remove

----
> cloudhub vpc environments remove [options] <vpc> [environments...]
----
This command removes the Anypoint VPC defined in `<vpc>` from the environment(s) passed as argument(s) thereafter. +
Besides the default `--help` option, this command also takes the option `--default`, that removes this Anypoint VPC as the default Anypoint VPC for the environment.

=== cloudhub vpc business-groups add

----
> cloudhub vpc business-groups add [options] <vpc> <businessGroups...>
----
This command assigns the Anypoint VPC defined in `<vpc>` to the business group(s) passed as argument(s) thereafter.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub vpc business-groups remove
----
> cloudhub vpc business-groups remove [options] <vpc> <businessGroups...>
----
This command removes the Anypoint VPC defined in `<vpc>` from the business group(s) passed as argument(s) thereafter +

[WARNING]
This command does not prompt twice before removing the Anypoint VPC from the specified resource. If you send a remove instruction, it does not ask for confirmation.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub vpc dns-servers set

----
> cloudhub vpc dns-servers set [options] <vpc>
----
This command sets a list of local host names (internal domain names) to be resolved using your DNS servers for which you need to provide their IP addresses (whether private or public addresses). +
Whenever those private domains are provided, your worker resolves them using your private DNS, so you can still use the internal host names of your private network.

[NOTE]
This feature is supported by workers running Mule versions 3.5.x, 3.6.x, 3.7.4, 3.8.0-HF1, 3.8.1 and 3.8.2.


Besides the default `--help`, `-f`/`--fields` and `-o`/`--output` options, this command also takes:

[%header,cols="20a,80a"]
|===
|Option |Description
| `server` | IP address for a DNS server to resolve special domains on. Can be specified up to 3 times
| `domain` | A domain to resolve on the special DNS server list. Can be specified multiple times
|===

You can pass as many domains as you need, and up to 3 IP addresses. +
For example, `$ cloudhub vpc dns-servers set --domain example.com --server 192.168.1.10 <VPC Name>`.

Every time you run this command, you overwrite your previous DNS set command. +
To remove a DNS set, you need to use the <<cloudhub vpc dns-servers unset,vpc dns-servers unset>> command.

=== cloudhub vpc dns-servers unset

----
> cloudhub vpc dns-servers unset [options] <vpc>
----
This command clears the list of local host names (internal domain names) to be resolved using your DNS servers from the Anypoint VPC passed in `<vpc>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== cloudhub vpc firewall-rules describe

----
> cloudhub vpc firewall-rules describe <vpc>
----
This command describes all the firewall rules for the Anypoint VPC defined in `<vpc>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]


=== cloudhub vpc firewall-rules add

----
> cloudhub vpc firewall-rules add [options] <vpc> <cidrBlock> <protocol> <fromPort> [toPort]
----
This command adds a firewall rule to the Anypoint VPC defined in `<vpc>` using the values set in the variables: +

[%header,cols="18a,62a,20a"]
|===
|Value |Description |Example
| `vpc` |Name of the Anypoint VPC to which this load balancer is bound. +
If your Anypoint VPC name contains spaces, you need to pass it between ´"´ characters | vpc-demo
| `cidrBlock` | IP address in CIDR notation for the firewall to allow  | 192.0.1.0/27
| `protocol` | The protocol to use in the rules. It can be `tcp` or `udp` | tcp
| `fromPort` | The port from which the firewall will allow requests. It can go from 0 to 65535 | 8888
| `toPort` | *optional* In case a port range is needed, the `fromPort` and `toPort` variables define such range | 8090
|===

[CAUTION]
--
When creating an Anypoint VPC, make sure to allow your outbound address. +
By default, all IP addresses are blocked, and you need to authorize IP addresses or range of addresses to your Anypoint VPC firewall rule.
--

You can start typing your Anypoint VPC's name and press `tab` for Anypoint Platform CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]


=== cloudhub vpc firewall-rules remove

----
> cloudhub vpc firewall-rules remove <vpc> <index>
----
This command removes the firewall rule from the workers inside the Anypoint VPC specified in `<vpc>` at the index passed in the `<index>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== use environment

This command is only available for interactive mode.

----
> use environment [options] <name>
----
This command makes active the environment specified in `<name>`.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]

=== use business-group

This command is only available for interactive mode.

----
> use business-group  [options] <name>
----
This command makes the business group you specified in `<name>` active.

[NOTE]
--
If your business group or organization name contains spaces, you need to enclose its name between `"` characters.

----
> use business-group "QA Organization"
----
--

=== exit

----
> exit [options]
----
This command exits Anypoint Platform CLI.

// CLI DEFAULTS
include::partial$cli-default-options.adoc[tag=CLIdefaultOptions]
